"""
згенерувати квадратну матрицю 'око' - всі значення 0-лі а по діагоналі 1ки

"""

def eye_matrix(size):
    a = []
    for i in range(size):
        a.append([0] * size)

    for i in range(size):
        for j in range(size):
            if i == j:
                a[i][j] = 1
            elif i > j and i < j:
                a[i][j] = 0
    return a

assert eye_matrix(3) == [[1, 0, 0], [0, 1, 0], [0, 0, 1]]
assert eye_matrix(4) == [[1, 0, 0, 0], [0, 1, 0, 0], [0, 0, 1, 0], [0, 0, 0, 1]]

"""
Будь ласка, в горі кожного завдання скопіюйте його умову. 
ваш код загортайте в функції чи в майбутьньому класи. Це потрібно для того щоб було легше тестувати асертами.
assert - підніме помилку, якщо умова не буде виконана. Так мені легко перевірити корекність роботи програми та вам 
сконцентруватись і зрозуміти що тре зробити

"""

